{
  "about": [
    {
      "id": 1,
      "title": "Our Story: Crafting Daily Delights:",
      "content": "My journey began with the joy of fulfilling orders, cooking hearty meals and baking treats with care for those who trusted my hands. Daily Delights is my heartfelt tribute, a legacy of love baked into every recipe, inviting you to taste the passion behind each bite."
    }
  ],
  "learning": [
    {
      "id": 1,
      "section": "basics",
      "title": "Seasoning Secrets Unveiled:",
      "content": "Unlock the true power of flavor. This section reveals the art of seasoning, showing you how to perfectly balance and layer spices, herbs, and salts. Transform your dishes from good to extraordinary with simple, intentional additions."
    },
    {
      "id": 2,
      "section": "baking",
      "title": "Baking with Alternative Flours:",
      "content": "Step into a versatile world of baking beyond traditional grains! Here at Daily Delights, we demystify baking with alternative flours, guiding you through the unique properties of options like almond, oat, and coconut flour. Learn how to adapt recipes, achieve perfect textures, and infuse your baked goods with exciting new flavors, opening up a whole new realm of delicious possibilities for your kitchen."
    },
    {
      "id": 3,
      "section": "tips",
      "title": "Quick Meal Prep Tricks:",
      "content": "Transform your cooking routine and reclaim your precious time with Daily Delights' clever meal prep tricks! Discover smart strategies for efficient chopping, batch cooking, and savvy storage that will streamline your kitchen work. Learn how simple planning can lead to stress-free weeknights, ensuring you always have delicious, homemade meals ready when hunger strikes. Get ready to revolutionize your approach to everyday eating!"
    }
  ],
  "categories": [
    {
      "id": 1,
      "category": "cakes-cookies",
      "title": "Delightful Dessert Creations:",
      "description": "Unleash your inner pastry chef with delightful dessert creations, featuring easy recipes for cakes, cookies, and more to sweeten your daily life.",
      "recipes": [
        {
          "id": 1,
          "title": "Chocolate Chip Cookie Bliss",
          "description": "A classic, gooey cookie packed with chocolate chips—perfect for a sweet treat any time of day!",
          "image": "assets/db03e53c057449564a8c3f285d4ae705.jpg",
          "ingredients": [
            "1 cup all-purpose flour",
            "1/2 cup butter, softened",
            "1/2 cup brown sugar",
            "1 egg",
            "1 cup chocolate chips",
            "1/2 tsp baking soda",
            "1/4 tsp salt"
          ],
          "instructions": [
            "Preheat oven to 350°F (175°C) and line a baking sheet with parchment paper.",
            "Cream butter and brown sugar in a bowl until smooth.",
            "Beat in the egg, then mix in flour, baking soda, and salt.",
            "Fold in chocolate chips and drop spoonfuls onto the baking sheet.",
            "Bake for 10-12 minutes until edges are golden. Let cool and enjoy!"
          ],
          "prepTime": "15 minutes",
          "cookTime": "12 minutes",
          "servings": "12 cookies",
          "tip": "Add a pinch of sea salt on top for a gourmet touch!"
        }
      ]
    },
    {
      "id": 2,
      "category": "bread",
      "title": "Artisan Bread Delights",
      "description": "Master the art of bread-making with artisan bread delights, featuring rustic recipes and simple techniques to fill your home with warm, delicious aromas.",
      "recipes": [
        {
          "id": 2,
          "title": "Classic Artisan Bread",
          "description": "A crusty, flavorful loaf perfect for any meal, baked with love and simple ingredients.",
          "image": "assets/6c2cfe421f4bf3490f2e8c127bc3237d.jpg",
          "ingredients": [
            "3 cups all-purpose flour",
            "1 1/2 cups water",
            "1 tsp salt",
            "1/2 tsp yeast"
          ],
          "instructions": [
            "Mix flour, salt, and yeast in a bowl. Add water and stir until a shaggy dough forms.",
            "Cover and let rise for 12-18 hours at room temperature.",
            "Preheat oven to 450°F (230°C) with a Dutch oven inside.",
            "Shape dough, place in the hot Dutch oven, and bake covered for 30 minutes, then uncovered for 15 minutes.",
            "Cool and enjoy the rustic flavor!"
          ],
          "prepTime": "20 minutes",
          "cookTime": "45 minutes",
          "servings": "1 loaf",
          "tip": "Add herbs like rosemary for extra aroma!"
        }
      ]
    },
    {
      "id": 3,
      "category": "main-meals",
      "title": "Flavorful Meal Highlights",
      "description": "Elevate your dinner table with our standout main meal recipes, bursting with bold flavors and simple preparation tips to make every bite a delight.",
      "recipes": [
        {
          "id": 3,
          "title": "Chicken Stir-Fry Delight",
          "description": "A quick and colorful main meal packed with tender chicken, crisp vegetables, and a savory sauce—perfect for a weeknight win!",
          "image": "assets/713a2fbcbccd3bf592ae096dba62544f.jpg",
          "ingredients": [
            "2 boneless chicken breasts, sliced",
            "1 cup broccoli florets",
            "1 bell pepper, sliced",
            "2 tbsp soy sauce",
            "1 tbsp olive oil",
            "1 tsp garlic, minced",
            "Salt and pepper to taste"
          ],
          "instructions": [
            "Heat olive oil in a large skillet over medium heat.",
            "Add minced garlic and sauté for 1 minute until fragrant.",
            "Stir in chicken slices, cooking until browned (about 5-7 minutes).",
            "Add broccoli and bell pepper, stirring for 3-4 minutes until crisp-tender.",
            "Pour in soy sauce, season with salt and pepper, and cook for another 2 minutes.",
            "Serve hot and enjoy your flavorful stir-fry!"
          ],
          "prepTime": "10 minutes",
          "cookTime": "15 minutes",
          "servings": "2-3",
          "tip": "Add a sprinkle of sesame seeds or chili flakes for extra flavor!"
        }
      ]
    }
  ],
  "cookbook": [
    {
      "id": 1,
      "title": "Curate Your Perfect Cookbook",
      "content": "Curate your perfect cookbook with recipes that reflect your journey, blending my love for crafting meals and baked goods into a personalized treasure trove of daily delights."
    },
    {
      "id": 2,
      "section": "favorite",
      "title": "Cherished Family Favorites",
      "content": "Discover cherished family favorites, a collection of beloved recipes passed down and perfected through my years of cooking and baking for those I love, now shared with you."
    }
  ],
  "shop": [
    {
      "id": 1,
      "title": "Discover Our Kitchen Goodies",
      "description": "Discover our kitchen goodies featuring premium baking essentials, flavorful spices, and fresh ingredients to elevate your daily recipes.",
      "items": [
        {
          "id": 1,
          "name": "Premium Almond Flour",
          "price": 8.99,
          "description": "High-quality almond flour for gluten-free baking."
        },
        {
          "id": 2,
          "name": "Organic Spices Set",
          "price": 12.5,
          "description": "A set of organic spices to enhance your dishes."
        },
        {
          "id": 3,
          "name": "Fresh Baking Yeast",
          "price": 3.25,
          "description": "Perfect for artisan bread and dough recipes."
        }
      ]
    }
  ],
  "favorites": [
    {
      "id": 1,
      "title": "Chocolate Chip Cookie Bliss",
      "category": "cakes-cookies"
    },
    {
      "id": 2,
      "title": "Classic Artisan Bread",
      "category": "bread"
    },
    {
      "id": 3,
      "title": "Chicken Stir-Fry Delight",
      "category": "main-meals"
    }
  ]
}